Revit 2027 API
Toposolid.GetSubDivisionIds Method
 Gets all element ids of Toposolid subdivisions with the current Toposolid as its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetSubDivisionIds()
Public Function GetSubDivisionIds As IList(Of ElementId)
public:
IList<ElementId^>^ GetSubDivisionIds()
member GetSubDivisionIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
 The array of Toposolid subdivision ids.
See Also
Reference
Toposolid Class
Autodesk.Revit.DB Namespace